// Настроить проект, вывести в консоль “Hello world!”.
// Вывести в консоль системные дату и время.

package Sem1;

import java.time.LocalDateTime;

public class Date_Time {
    public static void main(String[] args) {
        System.out.println("Hello world!");
        System.out.println(LocalDateTime.now());
    }
}
